Revit 2024 API
BuiltInFailures.ElectricalFailures.CircuitsOverlapAndDeleteSpareSpace Property
 More than one Spare/Space falls onto the same slot. These Spares/Spaces will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircuitsOverlapAndDeleteSpareSpace { get; }
Visual Basic
Public Shared ReadOnly Property CircuitsOverlapAndDeleteSpareSpace As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircuitsOverlapAndDeleteSpareSpace {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace